{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"DepthwiseConv2D","config":{"kernel_size":[43,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_DepthwiseConv2D1","trainable":true,"batch_input_shape":[null,43,232,1],"dtype":"float32","depth_multiplier":8,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null}},{"class_name":"MaxPooling2D","config":{"pool_size":[1,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D1","trainable":true}},{"class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true}},{"class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}}],"keras_version":"tfjs-layers 1.2.2","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.2.2","convertedBy":null,"weightsManifest":[{"paths":["./heyatlas_model.weights.bin"],"weights":[{"name":"depthwise_conv2d_DepthwiseConv2D1/depthwise_kernel","shape":[43,3,1,8],"dtype":"float32"},{"name":"depthwise_conv2d_DepthwiseConv2D1/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[920,3],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[3],"dtype":"float32"}]}]}